balazsgrill/modembed/res/Devices/dsPIC30/PIC24F16KA304.PIC
      <edc:DCRDef edc:access="--------nnnnnnnn" edc:cname="FPOR" edc:default="0xffff" edc:desc="" edc:impl="0xff" edc:name="FPOR" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x00ff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable bits" edc:mask="0x3" edc:name="BOREN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="BOR3" edc:desc="Brown-out Reset enabled in hardware, SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="BOR2" edc:desc="Brown-out Reset enabled only while device is active and disabled in SLEEP, SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="BOR1" edc:desc="Brown-out Rest controlled by SBOREN bit" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="BOR0" edc:desc="Brown-out Reset disabled in hardware, SBOREN bit disabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="LVRCFG" edc:desc="" edc:mask="0x1" edc:name="LVRCFG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Low Voltage regulator is not available" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Low Voltage regulator is available and controlled by LVREN bit" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PWRTEN" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2C1SEL" edc:desc="Alternate I2C1 Pin Mapping bit" edc:mask="0x1" edc:name="I2C1SEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Use Default SCL1/SDA1 Pins For I2C1" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SEC" edc:desc="Use  Alternate SCL1/ASDA1 Pins For I2C1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="V18" edc:desc="Brown-out Reset set to lowest voltage (1.8V)" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="V27" edc:desc="Brown-out Reset set at 2.7V" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="V30" edc:desc="Brown-out Reset set to Highest Voltage (3.0V)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LPBOR" edc:desc="Low-power Brown-Out Reset occurs around 2.0V" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="MCLRE" edc:desc="MCLR Pin Enable bit" edc:mask="0x1" edc:name="MCLRE" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="RA5 input pin disabled,MCLR pin enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="RA5 input pin enabled,MCLR disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------n-----nn" edc:cname="FICD" edc:default="0xffff" edc:desc="" edc:impl="0x83" edc:name="FICD" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x0083">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="ICD Pin Placement Select bits" edc:mask="0x3" edc:name="ICS" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="PGx1" edc:desc="EMUC/EMUD share PGC1/PGD1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PGx2" edc:desc="EMUC/EMUD share PGC2/PGD2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGx3" edc:desc="EMUC/EMUD share PGC3/PGD3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:DCRFieldDef edc:cname="BKBUG" edc:desc="Background Debugger Enable bit" edc:ishidden="true" edc:mask="0x1" edc:name="BKBUG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Background debugger disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Background debugger functions enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="--------nn-nnnnn" edc:cname="FDS" edc:default="0xffff" edc:desc="" edc:impl="0xDF" edc:name="FDS" edc:nzwidth="16" edc:unimplval="0" edc:unused="0" edc:useinchecksum="0x00DF">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DSWDTPS" edc:desc="Deep Sleep Watchdog Timer Postscale Select bits" edc:mask="0xf" edc:name="DSWDTPS" edc:nzwidth="4">
              <edc:DCRFieldSemantic edc:cname="DSWDTPSF" edc:desc="1:2,147,483,648 (25.7 Days)" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSE" edc:desc="1:536,870,912 (6.4 Days)" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSD" edc:desc="1:134,217,728 (38.5 Hours)" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSC" edc:desc="1:33,554,432 (9.6 Hours)" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSB" edc:desc="1:8,388,608 (2.4 Hours)" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPSA" edc:desc="1:2,097,152 (36 Minutes)" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS9" edc:desc="1:524,288 (9 Minutes)" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS8" edc:desc="1:131,072 (135 Seconds)" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS7" edc:desc="1:32,768 (34 Seconds)" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS6" edc:desc="1:8192 (8.5 Seconds)" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS5" edc:desc="1:2048 (2.1 Seconds)" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS4" edc:desc="1:512 (528 ms)" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS3" edc:desc="1:128 (132 ms)" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS2" edc:desc="1:32 (33 ms)" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS1" edc:desc="1:8 (8.3 ms)" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DSWDTPS0" edc:desc="1:2 (2.1 ms)" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTOSC" edc:desc="DSWDT Reference Clock Select bit" edc:mask="0x1" edc:name="DSWDTOSC" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="DSWDT uses Low Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="DSWDT uses Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="DSBOREN" edc:desc="Deep Sleep Zero-Power BOR Enable bit" edc:mask="0x1" edc:name="DSBOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Deep Sleep BOR enabled in Deep Sleep" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Deep Sleep BOR disabled in Deep Sleep" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DSWDTEN" edc:desc="Deep Sleep Watchdog Timer Enable bit" edc:mask="0x1" edc:name="DSWDTEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="DSWDT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="DSWDT disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x800" edc:xendaddr="0x1000">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x778" edc:regionid="sfrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
